qualcomm/qcom-test-automation-controller/source/library/src/PSOCPlatformConfiguration.cpp
// Copyright (c) Qualcomm Technologies, Inc. and/or its subsidiaries.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted (subject to the limitations in the
// disclaimer below) provided that the following conditions are met:
//
//     * Redistributions of source code must retain the above copyright
//         notice, this list of conditions and the following disclaimer.
//
//     * Redistributions in binary form must reproduce the above
//         copyright notice, this list of conditions and the following
//         disclaimer in the documentation and/or other materials provided
//         with the distribution.
//
//     * Neither the name of Qualcomm Technologies, Inc. nor the names of its
//         contributors may be used to endorse or promote products derived
//         from this software without specific prior written permission.
//
// NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE
// GRANTED BY THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT
// HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED
// WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
// MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
// IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
// ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
// DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
// GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
// IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
// OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
// IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

#include <qtac/PSOCPlatformConfiguration.h>
#include <qtac/StringUtilities.h>

#include <algorithm>
#include <stdexcept>

// JSON key constants
static const char* kPlatformEntries        = "pins";
static const char* kPinNumber              = "pin_number";
static const char* kEnabled                = "enabled";
static const char* kInitialValue           = "initial_value";
static const char* kPriority               = "initialization_priority";
static const char* kInverted               = "inverted";
static const char* kName                   = "name";
static const char* kToolTip                = "help_hint";
static const char* kButtonTooltip          = "tooltip";
static const char* kAuthor                 = "author";
static const char* kDescription           = "description";
static const char* kCommand                = "command";
static const char* kCommandGroup           = "command_group";
static const char* kClassicAction          = "classic_action";
static const char* kTabName                = "tab_name";
static const char* kRunPriority            = "run_priority";
static const char* kMinFirmwareVersion     = "supportedFirmwareVer";
static const char* kButtons                = "buttons";
static const char* kVariables              = "variables";
static const char* kScript                 = "script";
static const char* kModificationDate       = "modification_date";
static const char* kFileVersion            = "fileVersion";
static const char* kLabel                  = "label";
static const char* kTab                    = "tab";
static const char* kCellLocation           = "cellLocation";
static const char* kDefaultValue           = "default_value";
static const char* kType                   = "type";

// Static storage for factory defaults
PSOCPinEntries  _PSOCPlatformConfiguration::_classicActions;
PSOCI2CEntries  _PSOCPlatformConfiguration::_classicI2CActions;
PSOCI2CSlaves   _PSOCPlatformConfiguration::_classicSlaveConfigs;

// ---------------------------------------------------------------------------

_PSOCPlatformConfiguration::_PSOCPlatformConfiguration(PSOCVariant psocVariant)
    : _variant(psocVariant)
{
    if (_classicActions.isEmpty())
        _PSOCPlatformConfiguration::initialize(psocVariant);

    for (const auto& kv : _classicActions)
        _pinEntries[kv.first] = kv.second;

    if (psocVariant == ePSOCGPIOIIC)
    {
        _slaveConfigs = _classicSlaveConfigs;
        refreshSlaveConfig();
    }
}

// ---------------------------------------------------------------------------
// Pin list accessors
// ---------------------------------------------------------------------------

Pins _PSOCPlatformConfiguration::getPins()
{
    Pins result;
    PSOCPinList active = getActivePins();
    for (const auto& p : active)
    {
        PinEntry pe;
        pe._pin                    = p._pin;
        pe._enabled                = p._enabled;
        pe._hash                   = p._hash;
        pe._cellLocation           = p._cellLocation;
        pe._commandGroup           = p._commandGroup;
        pe._pinCommand             = p._pinCommand;
        pe._initialValue           = p._initialValue;
        pe._inverted               = p._inverted;
        pe._pinLabel               = p._pinLabel;
        pe._pinTooltip             = p._pinTooltip;
        pe._tabName                = p._tabName;
        pe._initializationPriority = p._initializationPriority;
        result.append(pe);
    }

    std::sort(result.begin(), result.end(), [](const PinEntry& a, const PinEntry& b) {
        if (a._tabName != b._tabName)       return a._tabName < b._tabName;
        if (a._commandGroup != b._commandGroup) return a._commandGroup < b._commandGroup;
        return a._pin < b._pin;
    });
    return result;
}

PSOCPinList _PSOCPlatformConfiguration::getAllPins()
{
    PSOCPinList result;
    for (const auto& kv : _pinEntries)
        result.append(kv.second);
    std::sort(result.begin(), result.end(), [](const PSOCPinData& a, const PSOCPinData& b) {
        return a._pin < b._pin;
    });
    return result;
}

PSOCPinList _PSOCPlatformConfiguration::getActivePins()
{
    PSOCPinList result;
    for (const auto& kv : _pinEntries)
        if (kv.second._enabled)
            result.append(kv.second);
    std::sort(result.begin(), result.end(), [](const PSOCPinData& a, const PSOCPinData& b) {
        return a._pin < b._pin;
    });
    return result;
}

// ---------------------------------------------------------------------------
// Getters / setters
// ---------------------------------------------------------------------------

