qualcomm/qcom-test-automation-controller/source/library/src/PSOCPlatformConfiguration.cpp
bool _PSOCPlatformConfiguration::getPinEnableState(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? it->second._enabled : true;
}
void _PSOCPlatformConfiguration::setPinEnableState(PinID pinId, bool newState)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinEnableState: invalid pin");
    it->second._enabled = newState;
}

bool _PSOCPlatformConfiguration::getInitialPinValue(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? it->second._initialValue : false;
}
void _PSOCPlatformConfiguration::setInitialPinValue(PinID pinId, bool newState)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setInitialPinValue: invalid pin");
    it->second._initialValue = newState;
}

uint64_t _PSOCPlatformConfiguration::getPinInitializationPriority(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? static_cast<uint64_t>(it->second._initializationPriority) : 0;
}
void _PSOCPlatformConfiguration::setPinInitializationPriority(PinID pinId, int priority)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinInitializationPriority: invalid pin");
    it->second._initializationPriority = priority;
}

bool _PSOCPlatformConfiguration::getPinInvertedState(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? it->second._inverted : false;
}
void _PSOCPlatformConfiguration::setPinInvertedState(PinID pinId, bool newState)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinInvertedState: invalid pin");
    it->second._inverted = newState;
}

qtac::String _PSOCPlatformConfiguration::getPinLabel(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? it->second._pinLabel : qtac::String();
}
void _PSOCPlatformConfiguration::setPinLabel(PinID pinId, const qtac::String& v)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinLabel: invalid pin");
    it->second._pinLabel = v;
}

qtac::String _PSOCPlatformConfiguration::getPinTooltip(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? it->second._pinTooltip : qtac::String();
}
void _PSOCPlatformConfiguration::setPinTooltip(PinID pinId, const qtac::String& v)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinTooltip: invalid pin");
    it->second._pinTooltip = v;
}

qtac::String _PSOCPlatformConfiguration::getPinCommand(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? it->second._pinCommand : qtac::String();
}
void _PSOCPlatformConfiguration::setPinCommand(PinID pinId, const qtac::String& v)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinCommand: invalid pin");
    it->second._pinCommand = v;
}

CommandGroups _PSOCPlatformConfiguration::getPinGroup(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? it->second._commandGroup : eUnknownCommandGroup;
}
void _PSOCPlatformConfiguration::setPinGroup(PinID pinId, CommandGroups commandGroup)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinGroup: invalid pin");
    it->second._commandGroup = commandGroup;
}

qtac::String _PSOCPlatformConfiguration::getClassicAction(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? it->second._classicAction : qtac::String();
}
void _PSOCPlatformConfiguration::setClassicAction(PinID pinId, const qtac::String& v)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setClassicAction: invalid pin");
    it->second._classicAction = v;
}

qtac::String _PSOCPlatformConfiguration::getTabName(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? it->second._tabName : qtac::String();
}
void _PSOCPlatformConfiguration::setTabName(PinID pinId, const qtac::String& v)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setTabName: invalid pin");
    it->second._tabName = v;
}

qtac::Point _PSOCPlatformConfiguration::getPinCellLocation(PinID pinId) const
{
    auto it = _pinEntries.find(pinId);
    return (it != _pinEntries.end()) ? it->second._cellLocation : qtac::Point(-1, -1);
}
void _PSOCPlatformConfiguration::setPinCellLocation(PinID pinId, const qtac::Point& v)
{
    auto it = _pinEntries.find(pinId);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinCellLocation: invalid pin");
    it->second._cellLocation = v;
}

// ---------------------------------------------------------------------------
// Tab cascade operations
// ---------------------------------------------------------------------------

void _PSOCPlatformConfiguration::cascadeTabDelete(const qtac::String& tabName)
{
    for (auto& kv : _pinEntries)
    {
        if (kv.second._tabName == tabName)
            kv.second._tabName = qtac::String();
    }
}

void _PSOCPlatformConfiguration::cascadeTabRename(const qtac::String& oldName,
                                                   const qtac::String& newName)
{
    for (auto& kv : _pinEntries)
    {
        if (kv.second._tabName == oldName)
            kv.second._tabName = newName;
    }
}

// ---------------------------------------------------------------------------
// JSON I/O
// ---------------------------------------------------------------------------

bool _PSOCPlatformConfiguration::read(json_t& j)
{
    const auto* jobj = j.if_object();
    if (!jobj) return false;

