qualcomm/qcom-test-automation-controller/source/library/src/PSOCPlatformConfiguration.cpp
    if (jobj->contains(kPlatformEntries) && jobj->at(kPlatformEntries).is_array())
    {
        for (const auto& peVal : jobj->at(kPlatformEntries).as_array())
        {
            const auto* pe = peVal.if_object();
            if (!pe) continue;
            PSOCPinData pinData;

            if (pe->contains(kPinNumber))
                pinData._pin = static_cast<PinID>(std::stoull(qtac::json_util::toString(pe->at(kPinNumber))));

            pinData._hash = strHash(qtac::String::number(static_cast<unsigned long long>(pinData._pin)));

            if (pe->contains(kEnabled))       pinData._enabled                = qtac::json_util::toBool(pe->at(kEnabled));
            if (pe->contains(kInitialValue))  pinData._initialValue           = qtac::json_util::toBool(pe->at(kInitialValue));
            if (pe->contains(kPriority))      pinData._initializationPriority = qtac::json_util::toInt(pe->at(kPriority));
            if (pe->contains(kInverted))      pinData._inverted               = qtac::json_util::toBool(pe->at(kInverted));
            if (pe->contains(kName))          pinData._pinLabel               = qtac::json_util::toString(pe->at(kName));
            if (pe->contains(kToolTip))       pinData._pinTooltip             = qtac::json_util::toString(pe->at(kToolTip));
            if (pe->contains(kCommand))       pinData._pinCommand             = qtac::json_util::toString(pe->at(kCommand));
            if (pe->contains(kCommandGroup))  pinData._commandGroup           = static_cast<CommandGroups>(qtac::json_util::toInt(pe->at(kCommandGroup)));
            if (pe->contains(kClassicAction)) pinData._classicAction          = qtac::json_util::toString(pe->at(kClassicAction));
            if (pe->contains(kTabName))       pinData._tabName                = qtac::json_util::toString(pe->at(kTabName));
            if (pe->contains(kRunPriority))
                pinData._cellLocation = toPoint(qtac::String(qtac::json_util::toString(pe->at(kRunPriority))));

            _pinEntries[pinData._pin] = pinData;
        }
    }

    // --- Load buttons ---
    _buttons.clear();
    if (jobj->contains(kButtons) && jobj->at(kButtons).is_array())
    {
        for (const auto& jbVal : jobj->at(kButtons).as_array())
        {
            const auto* jb = jbVal.if_object();
            if (!jb) continue;
            qtac::ButtonEntry btn;
            if (jb->contains(kName))         btn._name         = qtac::json_util::toString(jb->at(kName));
            if (jb->contains(kCommand))      btn._command      = qtac::json_util::toString(jb->at(kCommand));
            if (jb->contains(kCommandGroup)) btn._commandGroup = qtac::json_util::toInt(jb->at(kCommandGroup));
            if (jb->contains(kTab))          btn._tab          = qtac::json_util::toString(jb->at(kTab));
            if (jb->contains(kButtonTooltip)) btn._tooltip     = qtac::json_util::toString(jb->at(kButtonTooltip));
            if (jb->contains(kCellLocation))
            {
                qtac::Point pt = toPoint(qtac::String(qtac::json_util::toString(jb->at(kCellLocation))));
                btn._cellX = pt.x();
                btn._cellY = pt.y();
            }
            if (!btn._command.isEmpty() && !btn._name.isEmpty())
                _buttons.push_back(btn);
        }
    }

    // If no buttons were defined in the tcnf, inject the classic default Quick Settings.
    if (_buttons.empty())
    {
        static const struct { const char* name; const char* cmd; const char* tip; int col; int row; }
        kDefaultButtons[] = {
            { "Power On",              "powerOn",            "Powers on the MTP/Device",                        0, 0 },
            { "Power Off",             "powerOff",           "Powers off the MTP/Device",                       1, 0 },
            { "Boot to EDL",           "bootToEDL",          "Boots the device to emergency download",          2, 0 },
            { "Boot to Fastboot",      "bootToFastboot",     "Boots the device to fastboot",                    0, 1 },
            { "Boot to UEFI",          "bootToUEFI",         "Boots the device to UEFI Menu",                   1, 1 },
            { "Boot to Secondary EDL", "bootToSecondaryEDL", "Boots the device to secondary emergency download",2, 1 },
        };
        for (const auto& d : kDefaultButtons)
        {
            qtac::ButtonEntry btn;
            btn._name         = d.name;
            btn._command      = d.cmd;
            btn._tooltip      = d.tip;
            btn._commandGroup = 4;  // eQuickSettingsGroup
            btn._tab          = "General";
            btn._cellX        = d.col;
            btn._cellY        = d.row;
            _buttons.push_back(btn);
        }
    }

    // --- Load variables ---
    _variables.clear();
    if (jobj->contains(kVariables) && jobj->at(kVariables).is_array())
    {
        for (const auto& jvVal : jobj->at(kVariables).as_array())
        {
            const auto* jv = jvVal.if_object();
            if (!jv) continue;
            qtac::VariableEntry var;
            if (jv->contains(kName))    var._name    = qtac::json_util::toString(jv->at(kName));
            if (jv->contains(kLabel))   var._label   = qtac::json_util::toString(jv->at(kLabel));
            if (jv->contains(kButtonTooltip)) var._tooltip = qtac::json_util::toString(jv->at(kButtonTooltip));
            if (jv->contains(kType))    var._type    = static_cast<qtac::VariableType>(qtac::json_util::toInt(jv->at(kType)));
            if (jv->contains(kDefaultValue))
            {
                std::string dv = qtac::json_util::toString(jv->at(kDefaultValue));
                if (var._type == qtac::VariableType::Boolean)
                    var._defaultValue = (dv == "1" || dv == "true");
                else if (var._type == qtac::VariableType::Float)
                {
                    try { var._defaultValue = std::stof(dv); } catch (...) {}
                }
                else
                {
                    try { var._defaultValue = static_cast<unsigned int>(std::stoul(dv)); }
                    catch (...) { var._defaultValue = 0u; }
                }
            }
            if (jv->contains(kCellLocation))
            {
                qtac::Point pt = toPoint(qtac::String(qtac::json_util::toString(jv->at(kCellLocation))));
                var._cellX = pt.x();
                var._cellY = pt.y();
            }
            if (!var._name.isEmpty())
                _variables[var._name] = var;
        }
    }

    // Inject defaults for script timing variables if not defined in the tcnf.
    auto ensureVar = [&](const char* name, const char* label, const char* tooltip,
                         unsigned int defaultMs, int cellX, int cellY)
    {
        if (_variables.find(qtac::String(name)) == _variables.end())
        {
            qtac::VariableEntry v;
            v._name         = name;
            v._label        = label;
            v._tooltip      = tooltip;
            v._type         = qtac::VariableType::Integer;
            v._defaultValue = defaultMs;
            v._cellX        = cellX;
            v._cellY        = cellY;
            _variables[v._name] = v;
        }
    };
    ensureVar("edl",      "EDL timing (ms)",     "Configurable Boot to EDL timing in milliseconds",      1300, 0, 0);
    ensureVar("uefi",     "UEFI timing (ms)",     "Configurable Boot to UEFI timing in milliseconds",     8000, 0, 1);
    ensureVar("fastboot", "Fastboot timing (ms)", "Configurable Boot to fastboot timing in milliseconds", 8000, 1, 0);

    // --- Load and parse script ---
    if (jobj->contains(kScript) && jobj->at(kScript).is_string())
    {
        qtac::String scriptText = qtac::json_util::toString(jobj->at(kScript));
        TACCommands cmds;
        PSOCPinList activePins = getActivePins();
        for (const auto& p : activePins)
        {
            if (p._pinCommand.isEmpty()) continue;
            TACCommand tc;
            tc._pin     = p._pin;
            tc._command = p._pinCommand;
            cmds.append(tc);
        }
        _script.parseScript(scriptText, _variables, cmds);
    }

    if (jobj->contains(kModificationDate) && jobj->at(kModificationDate).is_string())
        _modificationDate = qtac::String(qtac::json_util::toString(jobj->at(kModificationDate)));
    if (jobj->contains(kFileVersion) && (jobj->at(kFileVersion).is_int64() || jobj->at(kFileVersion).is_uint64()))
        _fileVersion = qtac::json_util::toInt(jobj->at(kFileVersion));
    if (jobj->contains(kName) && jobj->at(kName).is_string())
        _name = qtac::String(qtac::json_util::toString(jobj->at(kName)));
    if (jobj->contains(kAuthor) && jobj->at(kAuthor).is_string())
        _author = qtac::String(qtac::json_util::toString(jobj->at(kAuthor)));
    if (jobj->contains(kDescription) && jobj->at(kDescription).is_string())
        _description = qtac::String(qtac::json_util::toString(jobj->at(kDescription)));

