qualcomm/qcom-test-automation-controller/source/library/src/PSOCPlatformConfiguration.cpp
    return true;
}

void _PSOCPlatformConfiguration::loadDefaultScript(const qtac::String& scriptText)
{
    if (scriptText.isEmpty() || !_script.isEmpty())
        return;

    TACCommands cmds;
    PSOCPinList activePins = getActivePins();
    for (const auto& p : activePins)
    {
        if (p._pinCommand.isEmpty()) continue;
        TACCommand tc;
        tc._pin     = p._pin;
        tc._command = p._pinCommand;
        cmds.append(tc);
    }
    _script.parseScript(scriptText, _variables, cmds);
}

void _PSOCPlatformConfiguration::write(json_t& j)
{
    boost::json::array pinsArray;
    for (const auto& kv : _pinEntries)
    {
        const PSOCPinData& p = kv.second;
        boost::json::object entry;
        entry[kPinNumber]     = qtac::String::number(static_cast<unsigned long long>(p._pin)).toStdString();
        entry[kEnabled]       = p._enabled;
        entry[kInitialValue]  = p._initialValue;
        entry[kPriority]      = p._initializationPriority;
        entry[kInverted]      = p._inverted;
        entry[kName]          = p._pinLabel.toStdString();
        entry[kToolTip]       = p._pinTooltip.toStdString();
        entry[kCommand]       = p._pinCommand.toStdString();
        entry[kCommandGroup]  = static_cast<int>(p._commandGroup);
        entry[kClassicAction] = p._classicAction.toStdString();
        entry[kRunPriority]   = fromPoint(p._cellLocation).toStdString();
        entry[kTabName]       = p._tabName.toStdString();
        pinsArray.push_back(entry);
    }
    j.as_object()[kPlatformEntries] = pinsArray;
}

// ---------------------------------------------------------------------------
// Factory defaults (ported from qcommon-console/PSOCPlatformConfiguration.cpp)
// ---------------------------------------------------------------------------

void _PSOCPlatformConfiguration::initialize(PSOCVariant psocVariant)
{
    auto add = [&](PinID pin,
                   const char* label,
                   const char* cmd,
                   const char* tooltip,
                   int priority,
                   CommandGroups group,
                   bool enabled,
                   const char* classic,
                   qtac::Point cell,
                   bool initialValue,
                   bool inverted,
                   const char* tab = "General")
    {
        PSOCPinData p;
        p._pin                    = pin;
        p._hash                   = strHash(qtac::String::number(static_cast<unsigned long long>(pin)));
        p._pinLabel               = label ? label : "";
        p._pinCommand             = cmd ? cmd : "";
        p._pinTooltip             = tooltip ? tooltip : "";
        p._initializationPriority = priority;
        p._commandGroup           = group;
        p._enabled                = enabled;
        p._classicAction          = classic ? classic : "";
        p._cellLocation           = cell;
        p._initialValue           = initialValue;
        p._inverted               = inverted;
        p._tabName                = tab;
        _classicActions[pin]      = p;
    };

    add(53, "Battery",           "battery", "Battery Disconnect",                           2, eConnectionGroup, true,  "TAC_POWER_OFF",         {0,0}, false, true);
    add(55, "USB 0",             "usb0",    "Disconnnects VBUS for USB 0",                  2, eConnectionGroup, true,  "TAC_USB0_DIS",          {1,0}, false, true);
    add(36, "USB 1",             "usb1",    "Disconnects VBUS for USB1",                    2, eConnectionGroup, true,  "TAC_USB1_DIS",          {2,0}, false, true);
    add(50, "Power Key",         "pkey",    "Presses the power key button",                -1, eButtonGroup,     true,  "TAC_TC_START",          {0,0}, false, false);
    add(34, "Volume Up",         "volup",   "Presses the volume up button",                -1, eButtonGroup,     true,  "TAC_VOL_UP",            {0,1}, false, false);
    add(51, "Volume Down",       "voldn",   "Presses the volume down button",              -1, eButtonGroup,     true,  "TAC_RESET_PRI",         {0,2}, false, false);
    add(18, "Disconnect UIM 1",  "uim1",    "Disconnects UIM 1",                           -1, eSwitchGroup,     true,  "TAC_UIM1_DIS",          {0,0}, false, false);
    add(19, "Disconnect UIM 2",  "uim2",    "Disconnects UIM 2",                           -1, eSwitchGroup,     true,  "TAC_UIM2_DIS",          {1,0}, false, false);
    add(54, "Emergency Download Mode (EDL)", "pedl", "Enables Primary Emergency Download Mode", -1, eSwitchGroup, true, "TAC_SW_DWNLD_PRI",     {0,1}, false, false);
    add(37, "Force PS_HOLD High","pshold",  "Forces PSHold high",                          -1, eSwitchGroup,     true,  "TAC_FORCE_PS_HOLD",     {0,2}, false, false);
    add(47, "Disconnect SD Card","sdcard",  "Disconnects the SD card slot",                -1, eSwitchGroup,     true,  "TAC_SDCARD_DISC",       {0,3}, false, false);
    add(16, "Embedded USB Debug (EUD)", "eud", "Enabled the embedded USB debugger",        -1, eSwitchGroup,     true,  "TC_EUD_EARLY_BOOT_EN",  {0,4}, false, false);
    add(21, "Headset Disconnect","headset", "Disconnects the headset",                     -1, eSwitchGroup,     true,  "TAC_HEADSET_DIS",       {0,5}, false, false);
    add(30, "Secondary Emergency Download Mode (EDL)", "sedl", "Secondary EDL",           -1, eSwitchGroup,     true,  "TAC_FORCE_USB_BOOT_SEC",{0,0}, false, false, "Fusion");
    add(31, "Secondary PM_RESIN_N", "sresn","Secondary PM_RESIN_N",                        -1, eSwitchGroup,     true,  "TAC_RESET_SEC",         {0,1}, false, false, "Fusion");
    add(29, "",                  "",        "",                                            -1, eUnknownCommandGroup, false, "", {-1,-1}, false, false);
    add(38, "",                  "",        "",                                            -1, eUnknownCommandGroup, false, "", {-1,-1}, false, false);
    add(39, "",                  "",        "",                                            -1, eUnknownCommandGroup, false, "", {-1,-1}, false, false);
    add(46, "",                  "",        "",                                            -1, eUnknownCommandGroup, false, "", {-1,-1}, false, false);
    add(48, "",                  "",        "",                                            -1, eUnknownCommandGroup, false, "", {-1,-1}, false, false);
    add(49, "",                  "",        "",                                            -1, eUnknownCommandGroup, false, "", {-1,-1}, false, false);
    add(15, "",                  "",        "",                                            -1, eUnknownCommandGroup, false, "TAC_SOFT_RESET", {-1,-1}, false, false);

    // --- I2C variant (ePSOCGPIOIIC) factory defaults ---
    if (psocVariant == ePSOCGPIOIIC && _classicI2CActions.isEmpty())
    {
        auto addI2C = [&](PinID pin, PinID slaveAddr, PinID writeAddr,
                          const char* label, const char* cmd, const char* tooltip,
                          const char* classicAction, bool enabled, CommandGroups group,
                          const char* tabName, qtac::Point cell, bool inverted = false)
        {
            PSOCI2CData d;
            d._pin          = pin;
            d._slaveAddress = slaveAddr;
            d._writeAddress = writeAddr;
            d._hash         = d.makeHash();
            d._pinLabel     = label;
            d._pinCommand   = cmd;
            d._pinTooltip   = tooltip;
            d._classicAction = classicAction;
            d._enabled      = enabled;
            d._commandGroup = group;
            d._tabName      = tabName;
            d._cellLocation = cell;
            d._inverted     = inverted;
            _classicI2CActions[d._hash] = d;
        };

        // KTS1622EUAATR entries (pins 0-15, slave 0x20)
        addI2C(0,  0x20, 0x02, "CSI0 MUX Select",  "csi0",   "High routes CSI to Camera B2B connector, low routes to 22-pin camera connector", "CSI0 MUX Select",  true,  eSwitchGroup, "KTS1622EUAATR", {0,0});
        addI2C(1,  0x20, 0x02, "CSI1 MUX Select",  "csi1",   "High routes CSI to Camera B2B connector, low routes to 22-pin camera connector", "CSI1 MUX Select",  true,  eSwitchGroup, "KTS1622EUAATR", {1,0});
        addI2C(2,  0x20, 0x02, "CSI2 MUX Select",  "csi2",   "High routes CSI to Camera B2B connector, low routes to 22-pin camera connector", "CSI2 MUX Select",  true,  eSwitchGroup, "KTS1622EUAATR", {2,0});
        addI2C(3,  0x20, 0x02, "CSI3 MUX Select",  "csi3",   "High routes CSI to Camera B2B connector, low routes to 22-pin camera connector", "CSI3 MUX Select",  true,  eSwitchGroup, "KTS1622EUAATR", {3,0});
        addI2C(4,  0x20, 0x02, "DSI0 MUX Select",  "dsi0",   "Routes DSI0 display output", "DSI0 MUX Select",  true,  eSwitchGroup, "KTS1622EUAATR", {4,0});
        addI2C(5,  0x20, 0x02, "DSI1 MUX Select",  "dsi1",   "Routes DSI1 display output", "DSI1 MUX Select",  true,  eSwitchGroup, "KTS1622EUAATR", {5,0});
        addI2C(6,  0x20, 0x02, "HDMI I2S Select",  "hdmii2s","Routes HDMI I2S",             "HDMI I2S Select",  true,  eSwitchGroup, "KTS1622EUAATR", {6,0});
        addI2C(7,  0x20, 0x02, "PCIE Select",      "pcie",   "Routes PCIe signals",         "PCIE Select",      true,  eSwitchGroup, "KTS1622EUAATR", {7,0});
        addI2C(8,  0x20, 0x03, "I2S0 MUX Select",  "i2s0",   "Routes I2S0",                 "I2S0 MUX Select",  true,  eSwitchGroup, "KTS1622EUAATR", {0,1});
        addI2C(9,  0x20, 0x03, "I2S1 MUX Select",  "i2s1",   "Routes I2S1",                 "I2S1 MUX Select",  true,  eSwitchGroup, "KTS1622EUAATR", {1,1});
        addI2C(10, 0x20, 0x03, "I2S2 MUX Select",  "i2s2",   "Routes I2S2",                 "I2S2 MUX Select",  true,  eSwitchGroup, "KTS1622EUAATR", {2,1});
        addI2C(11, 0x20, 0x03, "USB0 MUX Select",  "usb0mux","Routes USB0 path",             "USB0 MUX Select",  false, eSwitchGroup, "KTS1622EUAATR", {3,1});
        addI2C(12, 0x20, 0x03, "USB1 MUX Select",  "usb1mux","Routes USB1 path",             "USB1 MUX Select",  true,  eSwitchGroup, "KTS1622EUAATR", {4,1});
        addI2C(13, 0x20, 0x03, "SIM MUX Select",   "simmux", "Routes SIM card path",        "SIM MUX Select",   true,  eSwitchGroup, "KTS1622EUAATR", {5,1});
        addI2C(14, 0x20, 0x03, "I2S2 MUX B Select","i2s2b",  "Routes I2S2 alternate path",  "I2S2 MUX B Select",true,  eSwitchGroup, "KTS1622EUAATR", {6,1});
        addI2C(15, 0x20, 0x03, "Reserved",         "rsvd15", "Reserved",                    "Reserved",         false, eSwitchGroup, "KTS1622EUAATR", {7,1});

        // TCA9534APWR entries (pins 16-23, slave 0x38)
        addI2C(16, 0x38, 0x01, "SPI0 MUX Select",  "spi0",   "Routes SPI0 between camera/sensor path and Display B2B connector path", "SPIO MUX Select", true,  eSwitchGroup, "TCA9534APWR", {0,0});
        addI2C(17, 0x38, 0x01, "SPI1 MUX Select",  "spi1",   "Routes SPI1",                 "SPI1 MUX Select",  true,  eSwitchGroup, "TCA9534APWR", {1,0});
        addI2C(18, 0x38, 0x01, "NFC MUX Select",   "nfcmux", "Routes NFC signals",          "NFC MUX Select",   true,  eSwitchGroup, "TCA9534APWR", {2,0});
        addI2C(19, 0x38, 0x01, "EARC MUX Select",  "earc",   "Routes eARC signals",         "EARC MUX Select",  true,  eSwitchGroup, "TCA9534APWR", {3,0});
        addI2C(20, 0x38, 0x01, "Reserved",         "rsvd20", "Reserved",                    "Reserved",         false, eSwitchGroup, "TCA9534APWR", {4,0});
        addI2C(21, 0x38, 0x01, "Reserved",         "rsvd21", "Reserved",                    "Reserved",         false, eSwitchGroup, "TCA9534APWR", {5,0});
        addI2C(22, 0x38, 0x01, "Reserved",         "rsvd22", "Reserved",                    "Reserved",         false, eSwitchGroup, "TCA9534APWR", {6,0});
        addI2C(23, 0x38, 0x01, "Reserved",         "rsvd23", "Reserved",                    "Reserved",         false, eSwitchGroup, "TCA9534APWR", {7,0});

