qualcomm/qcom-test-automation-controller/source/library/src/PSOCPlatformConfiguration.cpp
        if (_classicSlaveConfigs.isEmpty())
        {
            PSOCI2CSlave slave;
            slave._variant      = eKTS1622EUAATR;
            slave._slaveAddress = 0x20;
            slave._configAddress = 0x02;
            slave._portCount    = 2;
            _classicSlaveConfigs.append(slave);

            slave._variant      = eTCA9534APWR;
            slave._slaveAddress = 0x38;
            slave._configAddress = 0x01;
            slave._portCount    = 1;
            _classicSlaveConfigs.append(slave);
        }
    }
}

// ---------------------------------------------------------------------------
// PSoC variant management
// ---------------------------------------------------------------------------

void _PSOCPlatformConfiguration::setVariant(PSOCVariant psocVariant)
{
    _variant = psocVariant;
}

// ---------------------------------------------------------------------------
// I2C slave configuration management
// ---------------------------------------------------------------------------

qtac::String _PSOCPlatformConfiguration::i2cSlaveTabName(const PSOCI2CSlave& slave)
{
    // Format: "KTS1622EUAATR (0x20)" etc.
    return psocSlaveToString(slave._variant) + " (0x"
         + qtac::String::number(static_cast<unsigned long long>(slave._slaveAddress), 16) + ")";
}

void _PSOCPlatformConfiguration::refreshSlaveConfig()
{
    _i2cEntries.clear();

    for (const auto& kv : _classicI2CActions)
    {
        const PSOCI2CData& classicEntry = kv.second;

        for (const auto& slave : _slaveConfigs)
        {
            if (psocSlaveToString(slave._variant) != classicEntry._tabName)
                continue;

            PSOCI2CData entry = classicEntry;
            entry._slaveAddress = slave._slaveAddress;
            entry._writeAddress = slave._configAddress;
            entry._hash         = entry.makeHash();
            entry._tabName      = i2cSlaveTabName(slave);

            _i2cEntries[entry._hash] = entry;
        }
    }

    rebuildI2CTabs();
}

void _PSOCPlatformConfiguration::rebuildI2CTabs()
{
    // No-op in source/: tab management is a GUI-layer concern.
    // In the upstream Qt code this adds Tab objects to _tabs.
    // The source library does not maintain the tab list.
}

PSOCI2CSlaves _PSOCPlatformConfiguration::getSlaveConfigs() const
{
    return _slaveConfigs;
}

void _PSOCPlatformConfiguration::addSlaveConfig(const PSOCI2CSlave& slave)
{
    _slaveConfigs.append(slave);
    refreshSlaveConfig();
}

void _PSOCPlatformConfiguration::removeSlaveConfig(PinID slaveAddress)
{
    for (int i = _slaveConfigs.size() - 1; i >= 0; --i)
        if (_slaveConfigs.at(i)._slaveAddress == slaveAddress)
            _slaveConfigs.removeAt(i);
    refreshSlaveConfig();
}

Pins _PSOCPlatformConfiguration::getI2CPinEntries()
{
    Pins result;
    for (const auto& kv : _i2cEntries)
    {
        const PSOCI2CData& d = kv.second;
        PinEntry pe;
        pe._pin          = d._pin;
        pe._enabled      = d._enabled;
        pe._hash         = d._hash;
        pe._cellLocation = d._cellLocation;
        pe._commandGroup = d._commandGroup;
        pe._pinCommand   = d._pinCommand;
        pe._inverted     = d._inverted;
        pe._pinLabel     = d._pinLabel;
        pe._pinTooltip   = d._pinTooltip;
        pe._tabName      = d._tabName;
        result.append(pe);
    }
    std::sort(result.begin(), result.end(), [](const PinEntry& a, const PinEntry& b) {
        if (a._tabName != b._tabName) return a._tabName < b._tabName;
        return a._pin < b._pin;
    });
    return result;
}

PSOCI2CEntries _PSOCPlatformConfiguration::getI2CEntries() const
{
    return _i2cEntries;
}

PSOCI2CEntries _PSOCPlatformConfiguration::getActiveI2CEntries() const
{
    PSOCI2CEntries result;
    for (const auto& kv : _i2cEntries)
        if (kv.second._enabled)
            result[kv.first] = kv.second;
    return result;
}

qtac::List<PSOCI2CData> _PSOCPlatformConfiguration::getI2CEntriesForSlave(const PSOCI2CSlave& slave) const
{
    qtac::String tabName = i2cSlaveTabName(slave);
    qtac::List<PSOCI2CData> result;
    for (const auto& kv : _i2cEntries)
    {
        const PSOCI2CData& d = kv.second;
        if (d._tabName == tabName && d._slaveAddress == slave._slaveAddress)
            result.append(d);
    }
    std::sort(result.begin(), result.end(), [](const PSOCI2CData& a, const PSOCI2CData& b) {
        return a._pin < b._pin;
    });
    int rowCount = slave._portCount * 8;
    while (result.size() > rowCount)
        result.removeAt(result.size() - 1);
    return result;
}

bool _PSOCPlatformConfiguration::addI2CSlave(const PSOCI2CData& i2cData)
{
    PSOCI2CData entry = i2cData;
    entry._hash = entry.makeHash();
    _i2cEntries[entry._hash] = entry;
    return true;
}

void _PSOCPlatformConfiguration::removeI2CSlave(HashType hash)
{
    _i2cEntries.remove(hash);
}

PSOCI2CData _PSOCPlatformConfiguration::getI2CSlave(HashType hash) const
{
    auto it = _i2cEntries.find(hash);
    return (it != _i2cEntries.end()) ? it->second : PSOCI2CData();
}

// ---------------------------------------------------------------------------
// I2C pin getters / setters
// ---------------------------------------------------------------------------

bool _PSOCPlatformConfiguration::getI2CPinEnableState(HashType hash) const
{
    auto it = _i2cEntries.find(hash);
    return (it != _i2cEntries.end()) ? it->second._enabled : true;
}
void _PSOCPlatformConfiguration::setI2CPinEnableState(HashType hash, bool newState)
{
    auto it = _i2cEntries.find(hash);
    if (it == _i2cEntries.end()) throw std::invalid_argument("setI2CPinEnableState: invalid hash");
    it->second._enabled = newState;
}

bool _PSOCPlatformConfiguration::getI2CPinInvertedState(HashType hash) const
{
    auto it = _i2cEntries.find(hash);
    return (it != _i2cEntries.end()) ? it->second._inverted : false;
}
void _PSOCPlatformConfiguration::setI2CPinInvertedState(HashType hash, bool newState)
{
    auto it = _i2cEntries.find(hash);
    if (it == _i2cEntries.end()) throw std::invalid_argument("setI2CPinInvertedState: invalid hash");
    it->second._inverted = newState;
}

qtac::String _PSOCPlatformConfiguration::getI2CPinLabel(HashType hash) const
{
    auto it = _i2cEntries.find(hash);
    return (it != _i2cEntries.end()) ? it->second._pinLabel : qtac::String();
}
void _PSOCPlatformConfiguration::setI2CPinLabel(HashType hash, const qtac::String& v)
{
    auto it = _i2cEntries.find(hash);
    if (it == _i2cEntries.end()) throw std::invalid_argument("setI2CPinLabel: invalid hash");
    it->second._pinLabel = v;
}

qtac::String _PSOCPlatformConfiguration::getI2CPinTooltip(HashType hash) const
{
    auto it = _i2cEntries.find(hash);
    return (it != _i2cEntries.end()) ? it->second._pinTooltip : qtac::String();
}
void _PSOCPlatformConfiguration::setI2CPinTooltip(HashType hash, const qtac::String& v)
{
    auto it = _i2cEntries.find(hash);
    if (it == _i2cEntries.end()) throw std::invalid_argument("setI2CPinTooltip: invalid hash");
    it->second._pinTooltip = v;
}

qtac::String _PSOCPlatformConfiguration::getI2CPinCommand(HashType hash) const
{
    auto it = _i2cEntries.find(hash);
    return (it != _i2cEntries.end()) ? it->second._pinCommand : qtac::String();
}
void _PSOCPlatformConfiguration::setI2CPinCommand(HashType hash, const qtac::String& v)
{
    auto it = _i2cEntries.find(hash);
    if (it == _i2cEntries.end()) throw std::invalid_argument("setI2CPinCommand: invalid hash");
    it->second._pinCommand = v;
}

CommandGroups _PSOCPlatformConfiguration::getI2CPinGroup(HashType hash) const
{
    auto it = _i2cEntries.find(hash);
    return (it != _i2cEntries.end()) ? it->second._commandGroup : eUnknownCommandGroup;
}
void _PSOCPlatformConfiguration::setI2CPinGroup(HashType hash, CommandGroups commandGroup)
{
    auto it = _i2cEntries.find(hash);
    if (it == _i2cEntries.end()) throw std::invalid_argument("setI2CPinGroup: invalid hash");
    it->second._commandGroup = commandGroup;
}

qtac::String _PSOCPlatformConfiguration::getI2CTabName(HashType hash) const
{
    auto it = _i2cEntries.find(hash);
    return (it != _i2cEntries.end()) ? it->second._tabName : qtac::String();
}
void _PSOCPlatformConfiguration::setI2CTabName(HashType hash, const qtac::String& v)
{
    auto it = _i2cEntries.find(hash);
    if (it == _i2cEntries.end()) throw std::invalid_argument("setI2CTabName: invalid hash");
    it->second._tabName = v;
}

qtac::Point _PSOCPlatformConfiguration::getI2CPinCellLocation(HashType hash) const
{
    auto it = _i2cEntries.find(hash);
    return (it != _i2cEntries.end()) ? it->second._cellLocation : qtac::Point(-1, -1);
}
void _PSOCPlatformConfiguration::setI2CPinCellLocation(HashType hash, const qtac::Point& v)
{
    auto it = _i2cEntries.find(hash);
    if (it == _i2cEntries.end()) throw std::invalid_argument("setI2CPinCellLocation: invalid hash");
    it->second._cellLocation = v;
}
